# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\AntonioFrancisco\Desktop\TFG Bluetooth Low Energy\TFG PSoC\TFG_BluetoothLowEnergy\BluetoothLowEnergy\TFG_BluetoothLowEnergy.cydsn\TFG_BluetoothLowEnergy.cyprj
# Date: Sat, 07 Mar 2020 12:30:34 GMT
#set_units -time ns
create_clock -name {CapSense_SampleClk(FFB)} -period 5312.5 -waveform {0 2656.25} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CapSense_SenseClk(FFB)} -period 5312.5 -waveform {0 2656.25} [list [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {I2C_SCBCLK(FFB)} -period 854.16666666666663 -waveform {0 427.083333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_SampleClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {CapSense_SenseClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 41 83} [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\AntonioFrancisco\Desktop\TFG Bluetooth Low Energy\TFG PSoC\TFG_BluetoothLowEnergy\BluetoothLowEnergy\TFG_BluetoothLowEnergy.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\AntonioFrancisco\Desktop\TFG Bluetooth Low Energy\TFG PSoC\TFG_BluetoothLowEnergy\BluetoothLowEnergy\TFG_BluetoothLowEnergy.cydsn\TFG_BluetoothLowEnergy.cyprj
# Date: Sat, 07 Mar 2020 12:29:50 GMT
